[
  {
    "_id": {
      "$oid": "683a9c98473aab64224d4b61"
    },
    "job_title": "Senior Data Scientist, Consumer",
    "company_name": "Reddit, Inc.",
    "job_location": "United States",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "Reposted 4 days ago",
    "apply_button_label": "Apply",
    "apply_url": "https://job-boards.greenhouse.io/reddit/jobs/5936181?gh_src=8a8a4d8a1us",
    "seniority_level": "Not Applicable",
    "job_id": "4046552800",
    "industry": "Internet/Technology",
    "comp_desc": "Reddit is the heart of the internet, where millions of people get together to talk about any topic imaginable. Share, vote, and decide what matters in everything from breaking news, to fandoms, lifehacks, gaming, sports, health, and the internet’s cutest animals. With over 100,000 subreddit communities about every topic you could think of (and thousands more you couldn’t), whatever it is, there’s a place for you on Reddit. Interested in joining our growing team? Check out redditinc.com/careers.",
    "tech_skills": "SQL, R, Python, online experimentation (A/B testing), causal inference, statistical techniques",
    "benefits": "Comprehensive Health benefits, 401k Matching, Workspace benefits for your home office, Personal & Professional development funds, Family Planning Support, Flexible Vacation, Reddit Global Days Off, 4+ months paid Parental Leave, Paid Volunteer time off",
    "qualifications": "Ph.D., M.S. or Bachelors degree in Statistics, Machine Learning, Economics, Computer Science, or other quantitative fields, 5+ years of industry data science experience for M.S. or Bachelors degree holders, 3+ years of industry data science experience for Ph.D. degree holders",
    "full_job_description": "About the job\nReddit is a community of communities. It’s built on shared interests, passion, and trust and is home to the most open and authentic conversations on the internet. Every day, Reddit users submit, vote, and comment on the topics they care most about. With 100,000+ active communities and approximately 101M+ daily active unique visitors, Reddit is one of the internet’s largest sources of information. For more information, visit redditinc.com.\n\nLocation: US remote-friendly or any office location - SF, LA, CHI, NY\n\nThe Data Science Team at Reddit is growing and we are looking for experienced Data Scientists to partner with our cross-functional partners (Product, Engineering, Designer, Marketing, Business Development etc.) to help us build and improve the systems that continuously drive our user and revenue growth.\n\nAs a Senior Data Scientist on the team, you will have the opportunity to play a significant role in driving the success of key product areas at Reddit (Consumer, Ads, Safety etc.). You will lead and contribute to defining the product strategy through measurement and metrics design, experimentation and causal analyses, supporting product decisions via deep data analyses, and research.\n\nThis person will be an industry technical leader with a solid technical background, strong business acumen, and excellent cross-functional stakeholders management skills. You will go through a general Data Scientists hiring process and get matched to the product area that best fits your background and interest.\n\nResponsibilities\n\nDevelop action-oriented insights to drive the product strategy through observational causal analysis and experiment meta-analysis, and clearly communicate results to stakeholders up to the C-suite to take action based on the recommendations\nUplevel experimentation practices on the team through guiding design, execution, and deep dive analyses to maximize learnings from A/B tests\nCreate new ETLs, tables, dashboards, and other self-serve tools to enable other data scientists and cross-functional partners to find and interact with data seamlessly\nDesign, evaluate, and/or measure team-level KPIs to enable quarterly goal setting and demonstrate team impact\nRegularly engage with stakeholders to gather feedback and share progress on work at all stages to ensure alignment between DS and other teams on business goals and outcomes\nMentor more junior data scientists and business partners in data science best practices and methods to increase data literacy and improve decision making\n\n\nRequired Qualifications\n\nRelevant experiences in quantitative or data science roles, preferably for a consumer-facing service/app\nPh.D., M.S. or Bachelors degree in Statistics, Machine Learning, Economics, Computer Science, or other quantitative fields (If M.S. or Bachelors degree, a minimum of 5+ years of industry data science experience required; If PhD degree, a minimum of 3+ years of industry data science experience required)\nExpertise in querying relational databases (SQL) and programming languages (e.g., R / Python)\nDeep understanding of online experimentation (A/B testing), causal inference, and statistical techniques\nComfortable in innovative and fast-paced environments, and a bias toward action\nStrong technical communication / data storytelling skills and demonstrated ability to discuss complex topics with technical and non-technical audiences alike\nAble to tackle ambiguous and undefined problems by creating an action plan, getting feedback, and iterating\n\n\nBenefits\n\nComprehensive Health benefits\n401k Matching\nWorkspace benefits for your home office\nPersonal & Professional development funds\nFamily Planning Support\nFlexible Vacation (please use them!) & Reddit Global Days Off\n4+ months paid Parental Leave\nPaid Volunteer time off\n\n\nPay Transparency\n\nThis job posting may span more than one career level.\n\nIn addition to base salary, this job is eligible to receive equity in the form of restricted stock units, and depending on the position offered, it may also be eligible to receive a commission. Additionally, Reddit offers a wide range of benefits to U.S.-based employees, including medical, dental, and vision insurance, 401(k) program with employer match, generous time off for vacation, and parental leave. To learn more, please visit https://www.redditinc.com/careers/.\n\nTo provide greater transparency to candidates, we share base pay ranges for all US-based job postings regardless of state. We set standard base pay ranges for all roles based on function, level, and country location, benchmarked against similar stage growth companies. Final offer amounts are determined by multiple factors including, skills, depth of work experience and relevant licenses/credentials, and may vary from the amounts listed below.\n\nThe Base Pay Range For This Position Is\n\n$190,800—$267,100 USD\n\nReddit is proud to be an equal opportunity employer, and is committed to building a workforce representative of the diverse communities we serve. Reddit is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If, due to a disability, you need an accommodation during the interview process, please let your recruiter know.",
    "c_logo": "logos/reddit,_inc._4046552800.png",
    "extract_date": "2025-05-31T11:37:01.703519",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "quantitative or data science roles, querying relational databases (SQL), programming languages (R / Python), online experimentation (A/B testing), causal inference, statistical techniques, technical communication, data storytelling, action plan creation, fast-paced environment adaptation",
    "flag": 1,
    "First Seen": "2025-05-31T11:37:20.635548",
    "Last Updated": "2025-05-31T11:37:20.635555"
  },
  {
    "_id": {
      "$oid": "683a9caa473aab64224d4b62"
    },
    "job_title": "Senior Data Scientist",
    "company_name": "VideoAmp",
    "job_location": "United States",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "Reposted 2 weeks ago",
    "apply_button_label": "Apply",
    "apply_url": "https://videoamp.com/job?gh_jid=7915373002",
    "seniority_level": "Not Applicable",
    "job_id": "4211384974",
    "industry": "Advertising Technology",
    "comp_desc": "VideoAmp is a software and data company creating a more sophisticated data-driven advertising ecosystem that redefines how media is valued, bought and sold. The VideoAmp platform provides measurement and optimization tools that unify audiences across the disparate systems of traditional TV, streaming video and digital media. Unlocking new value for those currently operating within a siloed view of their audiences, VideoAmp creates efficiencies for the entire industry. VideoAmp is transforming a 100-year old industry by powering a more effective three-way value exchange that results in advertisers increasing their return on investment, publishers increasing their revenues and improving the viewing experience for consumers.",
    "tech_skills": "Python, SQL, statistical modeling, machine learning, regression analysis, hypothesis testing, Bayesian methods, time-series analysis, big data technologies (Snowflake, Databricks), cloud platforms (AWS, GCP)",
    "benefits": "Discretionary and flexible paid time off, Spring, Summer, and Winter breaks, comprehensive medical, dental, and vision benefits, unlimited financial wellness sessions, 401k Plan with matching, HSA & FSA, commuter benefits, cell phone reimbursement, paid maternity and parental leave",
    "qualifications": "Master’s or Ph.D. in Statistics, Mathematics, Computer Science, Data Science, or related field, 5+ years of experience in data science, experience in statistical modeling and machine learning, proficiency in Python and SQL, experience in advertising technology industry is desirable",
    "full_job_description": "About the job\nVideoAmp is on a mission to create the best employee and workplace experience where people can bring their whole self to work everyday. We believe that accomplishing something great requires a special group of people who work hard, drive results and have a blast while doing it - people who challenge the status quo and embody our values. People who say “I’ll find a way” instead of saying “it can’t be done.”\n\nAt VideoAmp, we believe in challenging advertising paradigms to maximize value for clients. We do this by enabling companies to execute on business outcomes across their media investment instead of more traditional media metrics. VideoAmp is the software and data solutions company powering the convergence of linear TV and digital video advertising. Our solutions connect linear TV viewership with addressable data assets to benefit the marketing and media industries. This enables marketers and content owners to holistically plan, transact, and measure deduplicated audiences across digital video, OTT, connected and linear TV advertising.\n\nRole & Responsibilities\n\nUnited States, Remote\n\nWe are seeking a highly skilled Senior Data Scientist to join our team of advertising technology focused data scientists working on methodology development. The ideal candidate will have experience in statistical modeling, machine learning, and data analysis, with an understanding of advertising technology concepts. You will play a critical role in developing and implementing data-driven strategies, optimizing statistical methods, and supporting innovation within the company.\n\nDevelop and implement machine learning algorithms to analyze large-scale datasets, uncovering insights and trends that drive strategic decision-making.\nSupport the design, development, and deployment of advanced statistical models to optimize advertising campaign measurement and improve planning and targeting accuracy.\nCommunicate complex analytical concepts and results to stakeholders in a clear and concise manner.\nEnsure the integrity and accuracy of data through rigorous testing and validation of models.\nWork closely with engineering teams to integrate models into production systems, ensuring scalability and reliability.\n\nQualifications\n\nMaster’s or Ph.D. in Statistics, Mathematics, Computer Science, Data Science, or a related field.\nProven experience (5+ years) in data science, with a strong focus on statistical modeling and machine learning.\nProficiency in programming languages such as Python and SQL.\nExpertise in statistical techniques, including regression analysis, hypothesis testing, Bayesian methods, and time-series analysis.\nExperience with general machine learning frameworks and libraries. \nStrong analytical and problem-solving skills, with the ability to work with complex datasets and extract actionable insights.\nExcellent communication and presentation skills, with the ability to convey technical information to non-technical audiences.\nExperience in the advertising technology industry is highly desirable.\nFamiliarity with big data technologies such as Snowflake, Databricks, and cloud platforms (AWS, GCP, etc) is a plus.\n\nWhat We Offer\n\nThis position has a minimum salary of $150,000 - $170,000 + Equity + Benefits. The actual compensation offer will be determined by a number of factors, including, but not limited to, applicant's qualifications, skills, and experience.\n\nDiscretionary and flexible paid time off\nIn addition to standard US holidays off, VideoAmp employees also partake in Spring, Summer and Winter breaks\nComprehensive medical, dental, and vision benefits for you and your dependents - including multiple options fully covered by VideoAmp\nUnlimited financial wellness sessions with Origin financial advisors\n401k Plan with matching\nHSA & FSA\nCommuter Benefits\nCell Phone Reimbursement\nPaid Maternity and Parental Leave for All Family Additions\n\nWe are on a collective mission to bring equity and transparency into media measurement, and that begins with an honest, inclusive culture. At VideoAmp, we empower our team to thrive through collaboration, mentorship, and innovation. If you're passionate about all things data and tech, and have extensive knowledge and curiosity around the digital media space, we’d love to hear from you.\n\nAbove all, if you're eager to influence and support the revolutionary goals of a dynamic, cross-functional team - join us and make an impact!",
    "c_logo": "logos/videoamp_4211384974.png",
    "extract_date": "2025-05-31T11:37:27.860766",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "statistical modeling, machine learning, Python, SQL, regression analysis, hypothesis testing, Bayesian methods, time-series analysis, big data technologies, cloud platforms",
    "flag": 1,
    "First Seen": "2025-05-31T11:37:38.189826",
    "Last Updated": "2025-05-31T11:37:38.189831"
  },
  {
    "_id": {
      "$oid": "683a9cc3473aab64224d4b63"
    },
    "job_title": "Senior Data Scientist (L5), Games",
    "company_name": "Netflix",
    "job_location": "United States",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "Reposted 1 week ago",
    "apply_button_label": "Apply",
    "apply_url": "https://explore.jobs.netflix.net/careers/job/790301757409?microsite=netflix.com&utm_source=LinkedIn&domain=netflix.com",
    "seniority_level": "Not Applicable",
    "job_id": "4199135216",
    "industry": "Entertainment, Data Science, Gaming",
    "comp_desc": "Netflix is one of the world's leading entertainment services, with over 300 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.",
    "tech_skills": "SQL, Python, R, A/B testing, statistical modeling, data analysis",
    "benefits": "Not Applicable",
    "qualifications": "PhD degree in Statistics, Econometrics, Mathematics, Engineering, or a relevant quantitative field with at least 5 years of experience, or Master's degree in those fields with at least 8 years of experience",
    "full_job_description": "About the job\nNetflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nData Science and Engineering (‘DSE’) at Netflix is aimed at using data, analytics, and sciences to improve various aspects of our business. We are looking for a Senior Data Scientist to join our Games DSE team, leading experimentation and advanced data science needs. This role will be partnering closely with our Game studio stakeholders to drive data informed decisions by building predictive models, conducting statistical analysis and deriving business insights. As a member of this team, you will also play a critical role in presenting insights that shape our decision making and ensure decisions are sound from a statistical perspective.\n\nWhat You Will Do\n\nPartner with our Game stakeholders (e.g., Netflix Games Development team, Game Developers, Game Strategy, Planning & Analysis team) on advanced analytic initiatives (e.g., prediction modeling, causal inference, experimentation etc)\nLead the design, analysis, and interpretation of experiments that shape decision-making around Games at Netflix\nProactively perform data exploration to discover innovation and testing opportunities\nDrive and implement high impact projects end to end\nPresent your research and insights to key stakeholders\nWork with business stakeholders to connect analysis to key decisions that affect the business to influence and drive impact to the business\nBalance handling ad hoc requests while also driving larger projects forward \n\nWho You Are\n\nYou have at least 2 years of experience working in the Games industry as a Data Scientist. \nAt least 5 years of experience with a PhD degree in Statistics, Econometrics, Mathematics, Engineering or a relevant quantitative field or 8+ years of experience with a Master degree in those fields. \nYou have statistical skills utilized in A/B testing, analyzing observational data, and statistical modeling\nYou are comfortable working with large data sets and analyzing complex data with SQL and other tools such as Python or R\nYou have good business acumen on product innovations and excellent problem solving skills to translate business requirements to data science problems. \nYou have a strong bias to action, delivering results quickly with iteration instead of waiting for perfection\nYou are a fast learner and are comfortable with ambiguous requests. \nYou have exceptional communication skills and can manage stakeholder priorities directly \nWilling to mentor junior data scientists on the team to accelerate team growth. \n\nOur Culture\n\nYou can learn more about Netflix’s unique culture of Freedom and Responsibility, that presents an opportunity to work with some of the best and the brightest, allowing you to make a difference to our business in a meaningful way.\n\nAt Netflix, we carefully consider a wide range of compensation factors to determine your personal top of market. We rely on market indicators to determine compensation and consider your specific job, skills, and experience to get it right. These considerations can cause your compensation to vary and will also be dependent on your location.\n\nThe overall market range for this role is typically $170,000 - 720,000.\n\nThis market range is based on total compensation (vs. only base salary), which is in line with our compensation philosophy. Netflix is a unique culture and environment. Learn more here.\n\nInclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.\n\nWe are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.\n\nJob is open for no less than 7 days and will be removed when the position is filled.",
    "c_logo": "logos/netflix_4199135216.png",
    "extract_date": "2025-05-31T11:37:43.401030",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "Data Science, Games industry experience, statistical skills, SQL, Python, R, business acumen, problem-solving, communication skills, mentoring, A/B testing, statistical modeling",
    "flag": 1,
    "First Seen": "2025-05-31T11:38:03.157955",
    "Last Updated": "2025-05-31T11:38:03.157963"
  },
  {
    "_id": {
      "$oid": "683a9cd7473aab64224d4b64"
    },
    "job_title": "Senior Data Scientist",
    "company_name": "Tempus AI",
    "job_location": "Redwood City, CA",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "Reposted 3 days ago",
    "apply_button_label": "Apply",
    "apply_url": "https://community.workday.com/maintenance-page?d=5&s=1&e=1&o=",
    "seniority_level": "Not Applicable",
    "job_id": "4222441264",
    "industry": "Healthcare, Precision Medicine",
    "comp_desc": "Tempus is making precision medicine a reality by applying AI in healthcare, deriving insights from our expansive library of clinical data and molecular data. We enable physicians to make real-time, data-driven decisions to deliver personalized care and targeted therapies for patients through our analytical machine learning platform that uses the power of artificial intelligence in healthcare. We also work with partners to facilitate discovery, development, and delivery of optimized therapeutic options for patients through distinctive solution sets. Our mission is for each patient to benefit from the treatment of others who came before by providing the healthcare industry tools that learn as we gather more data. It’s About Time. For more information, visit tempus.com and follow us on Twitter (@TempusLabs).",
    "tech_skills": "SQL, R, Python, hypothesis testing, time to event analysis, generative AI, Git/GitHub, cloud computing, dbt (data build tool), Bigquery, Google Cloud Platform (GCP)",
    "benefits": "Incentive compensation, restricted stock units, medical benefits",
    "qualifications": "Bachelor’s degree in natural sciences or quantitative/computational discipline, Master’s degree, 3-5 years of work experience in data science or related field, exceptional data exploration and debugging skills, technical communication skills, experience with engineering practices for research computing, self-directed learning habits",
    "full_job_description": "About the job\nPassionate about precision medicine and advancing the healthcare industry?\n\nRecent advancements in underlying technology have finally made it possible for AI to impact clinical care in a meaningful way. Tempus' proprietary platform connects an entire ecosystem of real-world evidence to deliver real-time, actionable insights to physicians, providing critical information about the right treatments for the right patients, at the right time.\n\nWhat You’ll Do\n\nThe Data Science Operations team at Tempus collaborates with data scientists, engineers, and biostatisticians to enhance longitudinal clinical data for Tempus’s real-world data offering. We are seeking a solution-oriented Senior Data Scientist passionate about bringing high quality real world data to internal researchers and external teams at top Pharmaceutical and Life Science companies, all in pursuit of improving oncology patient care with one of the largest molecular and clinical databases of cancer patients in the world.\n\nWhat You’ll Do\n\nBecome an expert in Tempus longitudinal clinical data and patient tokenization to link third party datasets to Tempus’s real world data ecosystem\nDesign and execute concordance analyses and reliability studies to demonstrate the validity of real-world datasets, ensuring results meet standards for publication in scientific journals\nDevelop new methodologies for harmonizing and integrating various clinical data streams (e.g., EHR, claims, mortality data) to enhance the comprehensiveness and accuracy of clinical datasets\nPartner with internal stakeholder teams, including Outcomes Research, Engineering, Applied AI, Data Science, and others, to identify and implement enhancements to our data offering to meet diverse use cases\nExpand our automated data testing suite to proactively identify and address data regressions\nProvide subject matter expertise to internal technical and non-technical audiences, ensuring that methods and results are clearly understood and trusted\n\nBase Qualifications\n\nBachelor’s degree in the natural sciences or a quantitative/computational discipline (e.g., Statistics, Epidemiology, Informatics, Computer Science, Economics) with 3-5 years of work experience in data science or a related field. Alternatively, Master’s degree with 2-3 years of work experience.\nExceptional data exploration and debugging skills using SQL and either R or Python, with the ability to identify, diagnose, and resolve data issues efficiently\nEagerness to learn and develop expertise across interdisciplinary fields, including real world clinical data, hypothesis testing, time to event analysis, and generative AI. Candidates should be enthusiastic about building a comprehensive skill set over time and comfortable working across diverse disciplines.\nExcellent technical communication skills, including spoken and written communication, as well as the ability to create effective visuals to convey complex technical concepts\nTrack record of successfully working cross functionally to execute complex projects with multiple cross-functional stakeholders\nAbility to translate domain knowledge into testable data expectations\nExperience with engineering practices for research computing, including version control (Git/GitHub), code review, and cloud computing\nA habit of self-directed learning through peers, documentation, scientific literature, and hands-on involvement in diverse projects. Expect to learn something new every day.\n\nPreferred Qualifications\n\nHands-on experience working with real-world data, including administrative claims, electronic health records (EHR), or registry data.\nExperience with observational study design, hypothesis testing, and time to event analysis\nStrong organizational skills, with the ability to break down complex tasks into manageable subcomponents and effectively address each part while maintaining a focus on overall project goals\nAbility to understand complex systems end-to-end and anticipate the consequences of specific design choices as they propagate throughout that system\nExperience with test driven development and/or automated data testing through dbt (data build tool).\nExperience with Bigquery and/or Google Cloud Platform (GCP)\nThrive in a fast-paced environment and be willing to shift priorities seamlessly\nGoal orientation, self-motivation, strong sense of ownership, and drive to make a positive impact in healthcare.\n\nCalifornia Pay Range - $110,000 - $150,000 USD\n\nIllinois Pay Range - $90,000 - $135,000 USD\n\nThe expected salary range above is applicable if the role is performed from California and may vary for other locations (Colorado, Illinois, New York). Actual salary may vary based on qualifications and experience. Tempus offers a full range of benefits, which may include incentive compensation, restricted stock units, medical and other benefits depending on the position.\n\nAdditionally, for remote roles open to individuals in unincorporated Los Angeles – including remote roles- Tempus reasonably believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment: engaging positively with customers and other employees; accessing confidential information, including intellectual property, trade secrets, and protected health information; and appropriately handling such information in accordance with legal and ethical standards. Qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable law, including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act.\n\nWe are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "c_logo": "logos/tempus_ai_4222441264.png",
    "extract_date": "2025-05-31T11:38:09.401557",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "SQL, R, Python, hypothesis testing, time to event analysis, generative AI, Git/GitHub, cloud computing, dbt (data build tool), Bigquery, Google Cloud Platform (GCP)",
    "flag": 1,
    "First Seen": "2025-05-31T11:38:23.030174",
    "Last Updated": "2025-05-31T11:38:23.030179"
  },
  {
    "_id": {
      "$oid": "683a9cee473aab64224d4b65"
    },
    "job_title": "Senior Data Scientist",
    "company_name": "Dropbox",
    "job_location": "United States",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "1 week ago",
    "apply_button_label": "Apply",
    "apply_url": "https://jobs.dropbox.com/listing/6874605?gh_src=aonhf1",
    "seniority_level": "Not Applicable",
    "job_id": "4232823340",
    "industry": "Not Applicable",
    "comp_desc": "Dropbox is the one place to keep life organized and keep work moving. With more than 700 million registered users across 180 countries, we're on a mission to design a more enlightened way of working. To learn more about working at Dropbox, visit jobs.dropbox.com We also have a few simple guidelines to keep this space respectful and productive. Please avoid: - Harassing other people or using language that’s hateful, offensive, vulgar, or advocates violence - Trolling, fraud and spamming - Violating someone else’s rights or privacy - Advertising or soliciting donations - Link baiting - Posting off topic comments or thread hijacking We may remove comments that violate these guidelines.",
    "tech_skills": "Not Applicable",
    "benefits": "Not Applicable",
    "qualifications": "Not Applicable",
    "full_job_description": "About the job\nDropbox is a Virtual First company. For this role, we are hiring in Zones 2 and 3. Please refer to our Compensation section below to see what neighborhoods fall under each Zone.\n\nCompany Description\n\nDropbox isn’t just a workplace—it’s a living lab for more enlightened ways of working. We're a global community of bold visionaries and resourceful doers who are shaping the future of Dropbox—and with it the future of work. Our Virtual First model combines the autonomy of a distributed workplace with the power of human connection, making space for both meaningful work and meaningful relationships. With our start-up mindset and enterprise-level opportunities, you can be who you are and grow into who you’re meant to be. Here, you can own your impact to make work more intuitive, joyful, and human—for you as a Dropboxer and for hundreds of millions of people worldwide. If you're ready to push boundaries—and yourself— Dropbox is ready for you.\n\nTeam Description\n\nThe Dropbox Data Science team transforms data into powerful insights that inform everything we do at Dropbox. Combining applied analytics techniques with deep business insights, we investigate user behavior, product performance, and market trends to uncover new opportunities for growth, optimization, and innovation. Our work is highly collaborative: we work closely with Revenue, Product, and Marketing teams to enable data-driven development and personalized customer solutions. It’s also highly creative, as we experiment to develop tools and dashboards that democratize insights across Dropbox. If you are driven by solving challenging problems and using the power of data to deliver impactful, user-centered products and services, join our Data Sciences team. Areas of work include Applied Analytics, Experimentation, Data Engineering, Machine Learning, Business Intelligence, Data Visualization, and Statistical Modeling.\n\nRole Description\n\nWe're looking for a Data Scientist to partner with product, engineering, and design teams to answer key questions about how to grow revenue, optimize product, scale and monetize the business, and launch high-impact initiatives. We solve challenging problems and boost business growth through a deep understanding of user behaviors with applied analytics techniques and business insights. An ideal candidate should have robust knowledge of consumer lifecycle and behavior analysis, customer segmentation, digital campaigns, monetization analytics and business operations for a SaaS company.\n\nResponsibilities\n\nDevelop a deep understanding of customer journey phases and key business metrics\nPerform analytical deep-dives to analyze problems and opportunities, identify the hypothesis and design & execute experiments\nInform future experimentation design and roadmaps by performing exploratory analysis to understand user engagement behavior and derive insights\nCreate personalized segmentation strategies leveraging propensity models to enable targeting of offers and experiences based on user attributes \nIdentify key trends and build automated reporting & executive-facing dashboards to track the progress of acquisition, monetization, and engagement trends. \nExtract actionable insights through analyzing large, complex, multi-dimensional customer behavior data sets \nMonitor and analyze a high volume of experiments designed to optimize the product for user experience and revenue & promote best practices for multivariate experiments\nTranslate complex concepts into implications for the business via excellent communication skills, both verbal and written\nUnderstand what matters most and prioritize ruthlessly\nWork with cross-functional teams (including Data Science, Marketing, Product, Engineering, Design, User Research, and senior executives) to rapidly execute and iterate\n\nRequirements\n\nBachelors’ or above in quantitative discipline: Statistics, Applied Mathematics, Economics, Computer Science, Engineering, or related field\n5-8 + years experience using analytics to drive key business decisions; examples include business/product/marketing analytics, business intelligence, strategy consulting\nProven track record of being able to work independently and proactively engage with business stakeholders with minimal direction\nSignificant experience with SQL and large unstructured datasets such as Hadoop\nDeep understanding of statistical analysis, experimentation design, and common analytical techniques like regression, decision trees\nSolid background in running multivariate experiments to optimize a product or revenue flow\nStrong verbal and written communication skills\nProficiency in programming/scripting and knowledge of statistical packages like R or Python is a plus\n\nPreferred Qualifications\n\nProduct analytics experience in a SAAS company\nMasters’ or above in a quantitative discipline: Statistics, Applied Mathematics, Economics, Computer Science, Engineering, or related field\n\nCompensation\n\nUS Zone 1\nThis role is not available in Zone 1\n\nUS Zone 2\n$168,300—$227,700 USD\n\nUS Zone 3\n$149,600—$202,400 USD\n\nThe range(s) listed above is the expected annual salary/OTE (On-Target Earnings) for this role, subject to change.\n\nPlease note, OTE are for sales roles only.\n\nSalary/OTE is just one component of Dropbox’s total rewards package. All regular employees are also eligible for the corporate bonus program or a sales incentive (target included in OTE) as well as stock in the form of Restricted Stock Units (RSUs).\n\nDropbox takes a number of factors into account when determining individual starting pay, including job and level they are hired into, location/metropolitan area, skillset, and peer compensation. We target most new hire offers between the minimum up to the middle of the range.\n\nDropbox uses the zip code of an employee’s remote work location to determine which metropolitan pay range we use. Current US Zone locations are as follows:\n\n US Zone 1: San Francisco metro, New York City metro, or Seattle metro\n US Zone 2: Austin (TX) metro, Chicago metro, California (outside SF metro), Colorado, Connecticut (outside NYC metro), Delaware, Massachusetts, New Hampshire, New York (outside NYC metro), Oregon, Pennsylvania (outside NYC or DC metro), Washington DC metro, and West Virginia (DC metro)\n US Zone 3: All other US locations\n\nBenefits\n\nDropbox is committed to investing in the holistic health and wellbeing of all Dropboxers and their families. Our benefits and perks programs include, but are not limited to:\n\nCompetitive medical, dental, and vision coverage\n401(k) plan with a generous company match and immediate vesting\nFlexible PTO/Paid Time Off, paid holidays, Volunteer Time Off, and more, allowing you time to unplug, unwind, and refresh\nIncome Protection Plans: Life and disability insurance\nBusiness Travel Protection: Travel medical and accident insurance\nPerks Allowance to be used on what matters most to you, whether that’s wellness, learning and development, food and groceries, and much more\nParental benefits including: Parental Leave, Child and Adult Care, Day Care FSA, Fertility Benefits, Adoption and Surrogacy Support, and Lactation Support\nAccess to over 10,000 global co-working spaces through Gable.tomaking it easy to book flexible workspaces for collaboration or individual work\nQuarterly Cell phone and internet allowance\nMental health and wellness benefits\nDisability and neurodivergence support benefits\n\nAdditional benefit details are available upon request.\n\nDropbox is an equal opportunity employer. We are a welcoming place for everyone, and we do our best to make sure all people feel supported and connected at work. A big part of that effort is our support for members and allies of internal groups like Asians at Dropbox, BlackDropboxers, enABLE, TODOS (Latinx), Pridebox (LGBTQ), Vets at Dropbox, and Women at Dropbox.",
    "c_logo": "logos/dropbox_4232823340.png",
    "extract_date": "2025-05-31T11:38:32.609315",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "Not Applicable",
    "flag": 1,
    "First Seen": "2025-05-31T11:38:46.101487",
    "Last Updated": "2025-05-31T11:38:46.101491"
  },
  {
    "_id": {
      "$oid": "683a9cfe473aab64224d4b66"
    },
    "job_title": "Senior Data Scientist, Decisions - Rider Experience",
    "company_name": "Lyft",
    "job_location": "San Francisco County, CA",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Hybrid",
    "posted_date": "Reposted 1 week ago",
    "apply_button_label": "Apply",
    "apply_url": "https://app.careerpuck.com/job-board/lyft/job/7838090002?gh_jid=7838090002",
    "seniority_level": "Not Applicable",
    "job_id": "4140303854",
    "industry": "Transportation/Ridesharing",
    "comp_desc": "Whether it’s an everyday commute or a journey that changes everything, Lyft is driven by our purpose: to serve and connect. In 2012, Lyft was founded as one of the first ridesharing communities in the United States. Now, millions of drivers have chosen to earn on billions of rides. Lyft offers rideshare, bikes, and scooters all in one app — for a more connected world, with transportation for everyone.",
    "tech_skills": "SQL, Python, R, data science, visualization libraries",
    "benefits": "Medical, dental, and vision insurance, mental health benefits, family building benefits, child care and pet benefits, 401(k) plan, paid time off, paid parental leave, subsidized commuter benefits, Lyft Pink benefits",
    "qualifications": "Degree in a quantitative field (statistics, economics, applied math, operations research, engineering), 3+ years of industry experience in data science or analytics, proficiency in SQL, experience in programming (Python or R), experience in online experimentation and statistical analysis, strong oral and written communication skills",
    "full_job_description": "About the job\nAt Lyft, our purpose is to serve and connect. To do this, we start with our own community by creating an open, inclusive, and diverse organization.\n\nData Science is at the heart of Lyft’s products and decision-making. As a member of the Rider team, you will work in a dynamic environment, where we embrace moving quickly to build the world’s best transportation. Data Scientists take on a variety of problems ranging from shaping critical business decisions to building algorithms that power our internal and external products. We’re looking for passionate, driven Data Scientists to take on some of the most interesting and impactful problems in ridesharing.\n\nAs a Data Scientist, Decisions in the Rider team, you will leverage data and rigorous, analytical thinking to shape our rider app and make business decisions that put our customers first. You will identify and scope opportunities, shape priorities, recommend technical solutions, design experiments, and measure impact. You will bring a quantitative mindset to decision-making in partnership with product, design, engineering, business, and operations stakeholders throughout the organization.\n\nYou will report to a Data Science Manager in the Rider Science team.\n\nResponsibilities:\n\nLeverage data and analytic frameworks to identify opportunities for growth and efficiency \nPartner with product managers, engineers, marketers, designers, and operators to translate data insights into decisions and action\nDesign and analyze online experiments; communicate results and act on launch decisions\nDevelop analytical frameworks to monitor business and product performance\nEstablish metrics that measure the health of our products, as well as rider and driver experience\n\nExperience:\n\nDegree in a quantitative field such as statistics, economics, applied math, operations research or engineering (advanced degrees preferred), or relevant work experience\n3+ years of industry experience in a data science or analytics role\nProficiency in SQL - able to write structured and efficient queries on large data sets\nExperience in programming, especially with data science and visualization libraries in Python or R is helpful\nExperience in online experimentation and statistical analysis\nStrong oral and written communication skills, and ability to collaborate with and influence cross-functional partners\n\nBenefits:\n\nGreat medical, dental, and vision insurance options with additional programs available when enrolled\nMental health benefits\nFamily building benefits\nChild care and pet benefits\n401(k) plan to help save for your future\nIn addition to 12 observed holidays, salaried team members have discretionary paid time off, hourly team members have 15 days paid time off\n18 weeks of paid parental leave. Biological, adoptive, and foster parents are all eligible\nSubsidized commuter benefits\nLyft Pink - Lyft team members get an exclusive opportunity to test new benefits of our Ridership Program\n\nLyft is an equal opportunity/affirmative action employer committed to an inclusive and diverse workplace. All qualified applicants will receive consideration for employment without regards to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. We also consider qualified applicants with criminal histories consistent with applicable federal, state and local law.\n\nThis role will be in-office on a hybrid schedule — Team Members will be expected to work in the office 3 days per week on Mondays, Wednesdays, and Thursdays. Additionally, hybrid roles have the flexibility to work from anywhere for up to 4 weeks per year. #Hybrid\n\nThe expected base pay range for this position in the San Francisco area is $148,000 - $185,000. Salary ranges are dependent on a variety of factors, including qualifications, experience and geographic location. Range is not inclusive of potential equity offering, bonus or benefits. Your recruiter can share more information about the salary range specific to your working location and other factors during the hiring process.",
    "c_logo": "logos/lyft_4140303854.png",
    "extract_date": "2025-05-31T11:38:53.290099",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "SQL, Python, R, data science, online experimentation, statistical analysis, oral and written communication skills",
    "flag": 1,
    "First Seen": "2025-05-31T11:39:02.104972",
    "Last Updated": "2025-05-31T11:39:02.104988"
  },
  {
    "_id": {
      "$oid": "683a9d14473aab64224d4b67"
    },
    "job_title": "Senior Data Scientist",
    "company_name": "Fruitist",
    "job_location": "United States",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "3 weeks ago",
    "apply_button_label": "Apply",
    "apply_url": "https://jobs.ashbyhq.com/fruitist/47fc7ba4-bdd1-4dcf-9f27-8d1978e87bab?utm_source=utm_source%3Dsrc%3DLinkedIn",
    "seniority_level": "Not Applicable",
    "job_id": "4224371797",
    "industry": "Food and Agriculture",
    "comp_desc": "Fruitist is a premium superfruit brand setting a new standard for healthy snacking. Formerly known as Agrovision, the company launched Fruitist as its flagship consumer brand in 2020. Today, it’s one of the fastest-growing names in the global fresh fruit market. With over $1B in lifetime sales and $400M in revenue over the past 12 months, Fruitist products are now sold in 12,500+ stores across 28 countries, led by our best-selling Premium Jumbo Blueberries, prized for their bold flavor, satisfying crunch, and consistent quality. Fruitist is backed by world-class global investors, focused on health and consumer innovation. Our leadership team brings experience from Calm, Erewhon, McKinsey, Netflix, Nestlé, P&G, Red Bull, The Wonderful Company, and more - united by a mission to inspire enjoyable and nutritious snacking. Building on that momentum, Fruitist is expanding its portfolio across other premium superfruits, including blackberries, raspberries, and cherries with more varieties and snackable formats on the horizon.",
    "tech_skills": "Python, machine learning, AI, SQL, Spark, Pandas, Numpy, SciPy",
    "benefits": "Not Applicable",
    "qualifications": "Advanced degree in a quantitative field (e.g., computer science, engineering, physics, statistics, applied mathematics)",
    "full_job_description": "About the job\nFruitist is a modern food company on a mission to revolutionize snacking—and the numbers prove we’re well on our way. With over $1B in lifetime sales and $400M in revenue in the last year alone, we’re not chasing trends—we’re building a lasting brand at the intersection of health, sustainability, and innovation with our suite of snackable superfruits including berries and cherries.\n\nOur momentum is powered by a leadership team drawn from the likes of McKinsey, Calm, Red Bull, and Netflix, and backed by global investors who specialize in consumer and tech-forward ventures. Together, we’re leveraging data, supply chain technology, and a sustainability-first model to disrupt a $500 billion-dollar industry.\n\nWe’re hiring builders. Operators. Creators. People who want to move fast, learn faster, and grow alongside a company that’s reshaping snacking. If you’re looking for a company where your work shapes the business—and your career accelerates with it—welcome to Fruitist.\n\nAt Fruitist, we’re harnessing the power of data to revolutionize agriculture, and we’re looking for Senior Data Scientists to help lead the way. Reporting to the Head of Data, you’ll dive deep into complex datasets, unlocking impactful insights that fuel our next big moves. Using cutting-edge machine learning and AI modeling techniques and a problem-solving mindset, you’ll transform raw data into valuable, actionable recommendations—driving growth, innovation, and smarter decision-making across our global operations. Agrovision has invested deeply in collecting observations across the entirety of the value chain, to provide berry-level data ripe for transformation into predictive and prescriptive insights for business teams. We’re constantly experimenting with new technology and excited for our data science teams to drive the next generation of solution creation for our company globally. This role is remote, with priority given to those who reside in Chicago, Boston, New York, Dallas or Miami.\n\nWhat You’ll Do\n\nTurn business challenges and copious amounts of internal and external data into innovative analytics solutions that drive impact \nPartner with business leaders to identify opportunities to introduce data science practices and solutions to solve problems and improve business outcomes \nDevelop advanced ML/AI models and algorithms that spark innovation across the organization \nUse statistical analysis to uncover insights, identify trends, and measure performance \nMentor teams, guiding analytic strategies and weighing the best approaches \nAlign data engineering efforts with future data science goals for breakthrough results \nAdvise leaders on modeling risks, ensuring accurate insights and highly performant models are being developed \nCollaborate with engineers to implement scalable, high-impact data solutions \nLead by exploring best practices, being curious, running experiments, and collaborating with experts \nDrive transformation, inspiring teams to challenge norms and innovate \nManage end-to-end implementation of scalable, production-grade solutions \n\nWhat You’ll Need\n\nAdvanced degree in a quantitative field (e.g., computer science, engineering, physics, statistics, applied mathematics) \n5-10 years’ experience leading data science teams; experience with crop modeling, remote sensing a plus \nExpert level programming skills in Python with a focus on machine learning/AI, statistics and advanced analytics \nExperience with SQL, Spark, Pandas, Numpy, SciPy, is beneficial \nProblem solver and data specialist ability to translate business needs into actionable development workplans from scratch and support Data Scientist through development \nFamiliarity with statistical and data engineering techniques to extract actionable insights while ensuring integrity of outputs \nExperience handling large data sets and working with relational databases \nCollaborative mindset with the ability to partner with and clearly communicate complex ideas to both colleagues and clients \nExcellent communicator capable of analyzing issues, identifying causes, and recommending solutions quickly \n\nIf you meet most of the qualifications above and connect with our mission to inspire enjoyable and nutritious snacking, we want to hear from you! While we are tech-forward in our embrace of AI to enhance our growing capabilities, we’re human-centric in our hiring. This means all applications will be reviewed by humans, including yours. We aim to respond to applicants within two weeks. We look forward to hearing from you!",
    "c_logo": "logos/fruitist_4224371797.png",
    "extract_date": "2025-05-31T11:39:10.652532",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Permanent",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "Python, machine learning, AI, SQL, Spark, Pandas, Numpy, SciPy, statistical analysis, data engineering, relational databases, communication skills",
    "flag": 1,
    "First Seen": "2025-05-31T11:39:24.562959",
    "Last Updated": "2025-05-31T11:39:24.562968"
  },
  {
    "_id": {
      "$oid": "683a9d29473aab64224d4b68"
    },
    "job_title": "Senior Data Scientist",
    "company_name": "Atlassian",
    "job_location": "San Francisco, CA",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "2025-05-30",
    "apply_button_label": "Apply",
    "apply_url": "https://careers-americas.icims.com/jobs/15765/senior-data-scientist/job?iis=LinkedIn&iisn=LinkedIn_Job_Ad&mode=job",
    "seniority_level": "Not Applicable",
    "job_id": "4239890693",
    "industry": "Software Development, Data Science",
    "comp_desc": "Atlassian powers the collaboration that helps teams accomplish what would otherwise be impossible alone. From space missions and motor racing to bugs in code and IT requests, no task is too large or too small with the right team, the right tools, and the right practices. Over 300,000 global companies and 80% of the Fortune 500 rely on Atlassian’s software, like Jira, Confluence, Loom, and Trello, to help their teams work better together and deliver quality results on time. With our 300,000+ customers and team of 10,000+ Atlassians, we are building the next generation of team collaboration and productivity software. We believe the power of teams has the potential to change the world — one that is more open, authentic, and inclusive.",
    "tech_skills": "SQL, Python, R, Tableau, R-Shiny, Microstrategy, SAP Business Objects, Looker",
    "benefits": "Health coverage, paid volunteer days, wellness resources",
    "qualifications": "5+ Years of Experience in Data Science or related fields, Proficiency in SQL AND another data manipulation programming language (e.g Python, R), Expertise at telling stories with data and familiarity with at least one visualization tool, Experience in applying statistical concepts to business problems, Ability to craft analysis into well-written and persuasive content",
    "full_job_description": "About the job\nOverview\n\nWorking at Atlassian\n\nAtlassians can choose where they work – whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company.\n\nThis is a remote position. To help our teams work together effectively, this role requires you to be located in the Pacific / Mountain timezones.\n\nYour future team\n\nYou will be part of a world-class Data Science team that leverages data to drive insights about our products and customers. The Data Science team partners with Product Managers/Researchers/Data Engineers/Marketers/Privacy and Executive teams to drive and influence. They use a variety of analysis and data-science techniques to understand how Atlassian's customers engage with our products and communications and, in doing so, identify, design, and measure the success of product investments.\n\nResponsibilities\n\nIn this role, you will:\n\nCollaborate on a variety of product and business problems with a diverse set of cross-functional partners and become a trusted strategic partner through the structure and clarity of your work.\nApply technical expertise with quantitative analysis, experimentation, and the presentation of data to develop strategies for our business and help solve the business's biggest challenges.\nFocus on developing hypotheses through analytical approaches, different methodologies, frameworks, and technical approaches to test them.\nDefine, understand, and test opportunities to improve the products and business and influence roadmaps through insights and recommendations.\nPartner with cross-functional teams to inform, influence, and execute strategy decisions\nIdentify and measure the success of product efforts through forecasting and monitoring of key product metrics to understand trends.\nYou will use data to shape product development, quantify new opportunities, identify upcoming challenges, and ensure the products we build bring value to people, businesses, and Atlassian.\n\n\nQualifications\n\nMinimum Qualifications / Your background:\n\n5+ Years of Experience in Data Science or related fields\nProficiency in SQL AND another data manipulation programming language (e.g Python, R)\nExpertise at telling stories with data and familiarity with at least one visualization tool (e.g. Tableau, R-Shiny, Microstrategy, SAP Business Objects, Looker, etc.)\nExperience in applying statistical concepts (e.g. regressions, A/B tests, clustering, probability) to business problems\nExperience driving projects or programs which have had proven impact on business strategy and performance through your analytics skills\nAbility to craft analysis into well-written and persuasive content\n\n\nDesirable Qualifications\n\n7+ Years of Experience in Data Science or related fields OR 5+ Years of experience in Data Science along with a post-graduate degree or equivalent in a related field\nAn understanding of the SaaS business model and key metrics\n\n\nCompensation\n\nAt Atlassian, we strive to design equitable, explainable, and competitive compensation programs. To support this goal, the baseline of our range is higher than that of the typical market range, but in turn we expect to hire most candidates near this baseline. Base pay within the range is ultimately determined by a candidate's skills, expertise, or experience. In the United States, we have three geographic pay zones. For this role, our current base pay ranges for new hires in each zone are:\n\nZone A: $175,100 - $233,400\n\nZone B: $157,500 - $210,100\n\nZone C: $145,300 - $193,700\n\nThis role may also be eligible for benefits, bonuses, commissions, and equity.\n\nPlease visit go.atlassian.com/payzones for more information on which locations are included in each of our geographic pay zones. However, please confirm the zone for your specific location with your recruiter.\n\nOur Perks & Benefits\n\nAtlassian offers a variety of perks and benefits to support you, your family and to help you engage with your local community. Our offerings include health coverage, paid volunteer days, wellness resources, and so much more. Visit go.atlassian.com/perksandbenefits to learn more.\n\nAbout Atlassian\n\nAt Atlassian, we're motivated by a common goal: to unleash the potential of every team. Our software products help teams all over the planet and our solutions are designed for all types of work. Team collaboration through our tools makes what may be impossible alone, possible together.\n\nWe believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.\n\nTo provide you the best experience, we can support with accommodations or adjustments at any stage of the recruitment process. Simply inform our Recruitment team during your conversation with them.\n\nTo learn more about our culture and hiring process, visit go.atlassian.com/crh .",
    "c_logo": "logos/atlassian_4239890693.png",
    "extract_date": "2025-05-31T11:39:30.148099",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "Data Science, SQL, Python, R, Tableau, R-Shiny, Microstrategy, SAP Business Objects, Looker, Statistical Analysis, Data Visualization, Business Analysis",
    "flag": 1,
    "First Seen": "2025-05-31T11:39:45.274204",
    "Last Updated": "2025-05-31T11:39:45.274207"
  },
  {
    "_id": {
      "$oid": "683a9d42473aab64224d4b69"
    },
    "job_title": "Senior Data Scientist, AI",
    "company_name": "Ensemble Health Partners",
    "job_location": "United States",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "Reposted 6 days ago",
    "apply_button_label": "Apply",
    "apply_url": "https://community.workday.com/maintenance-page?d=5&s=1&e=1&o=",
    "seniority_level": "Not Applicable",
    "job_id": "4206247179",
    "industry": "Healthcare, Revenue Cycle Management",
    "comp_desc": "Ensemble manages more than $39 billion in net patient revenue (NPR) and partners with more unique health systems than any other revenue cycle firm to deliver holistic financial health solutions through end-to-end managed services partnerships. The firm helps providers maximize their current technology and deploys industry-leading solutions to meet the unique needs of their systems and patients. Ensemble focuses on delivering value quickly and sustaining high performance, meeting 100% of year-one client goals, exceeding 102% of year-one cash collections and delivering 5% average NPR lift across clients.",
    "tech_skills": "AI, Machine Learning, generative AI, LLMs, predictive modeling, pytorch, tensorflow, scikit-learn, xgboost, Python, R, SQL, langchain, llamaindex, haystack, Azure AI studio, vector databases, retrieval techniques, SQL, Azure Data Factory, Hadoop, Spark, Continuous Integration, Unit/Integration Testing, MLOps, Revenue Cycle Management",
    "benefits": "Bonus Incentives, Paid Certifications, Tuition Reimbursement, Comprehensive Benefits, Career Advancement",
    "qualifications": "PhD or MSc in Computer Science/Machine Learning/AI, 3+ years experience working in data scientist capacity, 3+ years’ experience with Machine Learning ecosystem tools, Statistical Analysis proficiency, Strong programming skills, Data Visualization skills, Experience with LLM-based pipeline, Proficiency in Software Development best practices, Knowledge of Revenue Cycle Management, Ability to work independently and in a team-based environment, Excellent communication skills",
    "full_job_description": "About the job\nThank you for considering a career at Ensemble Health Partners!\n\nEnsemble Health Partners is a leading provider of technology-enabled revenue cycle management solutions for health systems, including hospitals and affiliated physician groups. They offer end-to-end revenue cycle solutions as well as a comprehensive suite of point solutions to clients across the country.\n\nEnsemble keeps communities healthy by keeping hospitals healthy. We recognize that healthcare requires a human touch, and we believe that every touch should be meaningful. This is why our people are the most important part of who we are. By empowering them to challenge the status quo, we know they will be the difference!\n\nO.N.E Purpose:\n\nCustomer Obsession: Consistently provide exceptional experiences for our clients, patients, and colleagues by understanding their needs and exceeding their expectations.\nEmbracing New Ideas: Continuously innovate by embracing emerging technology and fostering a culture of creativity and experimentation.\nStriving for Excellence: Execute at a high level by demonstrating our “Best in KLAS” Ensemble Difference Principles and consistently delivering outstanding results.\n\n\nThe Opportunity: \n\nThank you for considering a career at Ensemble Health Partners!\n\nHealthcare impacts each of us, yet the current system remains fundamentally broken. Many of us have seen loved ones face the devastating challenge of unaffordable care. At Ensemble, we are committed to changing this reality by driving down healthcare costs and eliminating obstacles, creating a system that truly puts people first, last, and always.\n\nWe are dedicated to revolutionizing healthcare with cutting-edge, technology-enabled revenue cycle management solutions for health systems. We’re here to solve how to reduce the friction and improve the cost of healthcare for better client and patient outcomes. As a leader in revenue technology, Ensemble is redefining what is possible in healthcare through innovation, purpose and human-centered solutions. We offer end-to-end revenue cycle solutions as well as a comprehensive suite of point solutions to clients across the country.\n\nWhy do we do what we do? It’s all about our O.N.E Purpose:\n\nOur commitment to transforming healthcare goes beyond technology and innovation. It’s rooted in a purpose-driven approach that emphasizes customer obsession, embraces new ideas, and strives for excellence—principles that define our O.N.E Purpose and inspire everything we do.\n\nCustomer Obsession: Consistently provide exceptional experiences for our clients, patients, and colleagues by understanding their needs and exceeding their expectations.\nEmbracing New Ideas: Continuously innovate by embracing emerging technology and fostering a culture of creativity and experimentation.\nStriving for Excellence: Execute at a high level by demonstrating our “Best in KLAS” Ensemble Difference Principles and consistently delivering outstanding results.\n\n\nThe Opportunity:\n\nEnabling healthcare professionals with technological solutions is key to the future of healthcare, and at Ensemble, we are solving problems in healthcare with AI.\n\nAre you passionate about leveraging AI to solve complex problems in healthcare? Do you want to be part of a team that is transforming the industry with cutting-edge technology? Join Ensemble Health Partners to leverage the superpower of AI to solve some of the most complex problems in healthcare.\n\nWhy Join Us?\n\nPeople First, Last + Always: At Ensemble, we prioritize people over processes, valuing your contributions, supporting your growth and enabling you to make a difference every day.\nMake a Difference with Purposeful Work: By leveraging cutting-edge AI technology, you will play a vital part in reducing healthcare costs, revolutionizing care delivery and enhancing the patient experience.\nInnovate Boldly in a Dynamic Environment: Thrive in a dynamic, entrepreneurial culture within an organization that champions creativity and groundbreaking ideas.\nShape the Future of Healthcare Across a Robust Client Base: Drive change across a vast client base, empowering healthcare systems at an unprecedented pace. When you innovate here, the ripple effect is enormous.\nTechnology-Driven Innovation: Since 2021, our patented innovations and EIQ has reshaped healthcare through cutting-edge innovation.\n\n\nJob Summary\n\nTake on a pivotal role in addressing healthcare’s toughest challenges with advanced AI solutions. As a Senior Data Scientist, you’ll build AI and Machine learning models and pipelines, with a focus on generative AI, LLMs and predictive modelling. predictive analytics. Your work will enable hospitals and health systems to operate more efficiently and deliver better patient outcomes.\n\nThe successful Senior Data Scientist candidate will work closely with business and product owners to understand their data requirements and product specification in order to help them make data-related decisions and product design choices. The role will also require close work with software engineers and developers to deliver solutions. The job role may also require you to learn new tools and technologies fast, which will be well supported by in-depth ML/AI knowledge as well as basic programming and scripting skills.\n\nYou should have practical experience in the design, development, management, and maintenance of systems and handling of large datasets. You should have hands on experience with common machine learning and AI frameworks, and a good knowledge of AI and machine learning fundamentals (deep learning, regression, classification and clustering algorithms), retrieval augmented generation pipelines, as well as a good grasp of the design and evaluation of LLM-supported use cases.\n\nEssential Job Functions\n\nLead AI strategy by delivering solutions that combine software engineering, statistics, and machine learning effectively for complex clinical applications.\nExecute deep, thoughtful, analytical experiments that utilize the most appropriate techniques and lead to substantial incremental improvements.\nDeliver excellent reports and presentations to highlight relevant hypothesis and insights that drive decision making within the organization.\nIdentify, collect, transform and explore data to become the resident expert on available data within the organization.\nCoordinate between Engineers and Product Analysts and the broader organization to facilitate seamless collaboration.\n\n\nOther Preferred Knowledge, Skills And Abilities\n\n3+ years experience working in data scientist capacity.\nPhD or MSc in Computer Science/Machine Learning/AI, or related work experience with the design, building and evaluation of Machine Learning systems.\n3+ years’ experience with Machine Learning ecosystem tools, including pytorch/tensorflow, scikit-learn, xgboost or equivalents.\nStatistical Analysis: Proficiency in statistical techniques and tools.\nMachine Learning: Knowledge of machine learning algorithms and their applications.\nProgramming: Strong programming skills (e.g., Python, R, or SQL).\nData Visualization: Ability to create meaningful visualizations.\nAbility to design, implement, test and deploy Machine Learning models.\nExperience working with and evaluating LLM-based pipeline, with an emphasis on retrieval augmented generation and prompting techniques is a plus.\nFamiliarity with langchain/llamaindex/haystack/Azure AI studio, vector databases and retrieval techniques, or equivalent common tools in the emerging LLM-enabled tech stack is a plus.\nProficiency in accessing and handling databases via SQL, Azure Data Factory or similar.\nAlternatively, familiarity with data storage/management systems or Big Data frameworks (like Hadoop, Spark) expected to be known or used.\nProficiency in Software Development best practices such as Continuous Integration, Unit/Integration Testing, Code Reviews.\nUnderstanding of MLOps fundamentals, including orchestration tools, cloud compute, and observability tools.\nKnowledge of Revenue Cycle Management, Collections, or financial industries is desirable but not necessary.\nAbility to work both independently and in a team-based, fast-paced environment.\nExcellent communication skills, both written and verbal.\n\n\nDesired Work Experience\n\n5 to 7 Years\n\n\nDesired Education\n\nPost Graduate Degree or Equivalent Experience \n\n\nCAREER OPPORTUNITY OFFERING:\n\nBonus Incentives\nPaid Certifications\nTuition Reimbursement\nComprehensive Benefits\nCareer Advancement\nThis position pays between $83,200 - $159,450 based on experience \n\n\n\n\nJoin An Award-winning Company\n\nFive-time winner of “Best in KLAS” 2020-2022, 2024-2025\n\nBlack Book Research's Top Revenue Cycle Management Outsourcing Solution 2021-2024\n\n22 Healthcare Financial Management Association (HFMA) MAP Awards for High Performance in Revenue Cycle 2019-2024\n\nLeader in Everest Group's RCM Operations PEAK Matrix Assessment 2024\n\nClarivate Healthcare Business Insights (HBI) Revenue Cycle Awards for strong performance 2020, 2022-2023\n\nEnergage Top Workplaces USA 2022-2024\n\nFortune Media Best Workplaces in Healthcare 2024\n\nMonster Top Workplace for Remote Work 2024\n\nGreat Place to Work certified 2023-2024\n\nInnovation\nWork-Life Flexibility\nLeadership\nPurpose + Values\n\n\nBottom line, we believe in empowering people and giving them the tools and resources needed to thrive. A few of those include:\n\nAssociate Benefits – We offer a comprehensive benefits package designed to support the physical, emotional, and financial health of you and your family, including healthcare, time off, retirement, and well-being programs. \nOur Culture – Ensemble is a place where associates can do their best work and be their best selves. We put people first, last and always. Our culture is rooted in collaboration, growth, and innovation. \nGrowth – We invest in your professional development. Each associate will earn a professional certification relevant to their field and can obtain tuition reimbursement. \nRecognition – We offer quarterly and annual incentive programs for all employees who go beyond and keep raising the bar for themselves and the company. \n\n\nEnsemble Health Partners is an equal employment opportunity employer. It is our policy not to discriminate against any applicant or employee based on race, color, sex, sexual orientation, gender, gender identity, religion, national origin, age, disability, military or veteran status, genetic information or any other basis protected by applicable federal, state, or local laws. Ensemble Health Partners also prohibits harassment of applicants or employees based on any of these protected categories.\n\nEnsemble Health Partners provides reasonable accommodations to qualified individuals with disabilities in accordance with the Americans with Disabilities Act and applicable state and local law. If you require accommodation in the application process, please contact TA@ensemblehp.com.\n\nThis posting addresses state specific requirements to provide pay transparency. Compensation decisions consider many job-related factors, including but not limited to geographic location; knowledge; skills; relevant experience; education; licensure; internal equity; time in position. A candidate entry rate of pay does not typically fall at the minimum or maximum of the role’s range.\n\nEEOC – Know Your Rights\n\nFMLA Rights - English\n\nLa FMLA Español\n\nE-Verify Participating Employer (English and Spanish)\n\nKnow your Rights",
    "c_logo": "logos/ensemble_health_partners_4206247179.png",
    "extract_date": "2025-05-31T11:39:55.571806",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "AI, Machine Learning, pytorch, tensorflow, scikit-learn, xgboost, Python, R, SQL, langchain, llamaindex, haystack, Azure AI studio, vector databases, retrieval techniques, SQL, Azure Data Factory, Hadoop, Spark, Continuous Integration, Unit/Integration Testing, MLOps, Revenue Cycle Management",
    "flag": 1,
    "First Seen": "2025-05-31T11:40:10.777004",
    "Last Updated": "2025-05-31T11:40:10.777011"
  },
  {
    "_id": {
      "$oid": "683a9d5a473aab64224d4b6a"
    },
    "job_title": "Senior Data Scientist/Applied Scientist, AI Products",
    "company_name": "Attentive",
    "job_location": "San Francisco, CA",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Hybrid",
    "posted_date": "1 week ago",
    "apply_button_label": "Apply",
    "apply_url": "https://jobs.lever.co/attentive/86d62177-c50e-4cb2-b48f-a9cd50735cb4/apply?lever-source=LinkedIn",
    "seniority_level": "Not Applicable",
    "job_id": "4233763872",
    "industry": "Marketing Technology",
    "comp_desc": "Attentive® is the AI marketing platform for leading brands, designed to optimize message performance through 1:1 SMS and email interactions. Infusing intelligence at every stage of the consumer's purchasing journey, Attentive empowers businesses to achieve hyper-personalized communication with their customers on a large scale. Leveraging AI-powered tools, a mobile-first approach, two-way conversations, and enterprise-grade technology, Attentive drives billions in online revenue for brands around the globe. Trusted by over 8,000 leading brands such as CB2, Urban Outfitters, GUESS, and Dickey’s Barbeque Pit, Attentive is the go-to solution for delivering powerful commerce experiences for consumers with the brands they love. To learn more about Attentive or to request a demo, visit www.attentive.com",
    "tech_skills": "Python, SQL",
    "benefits": "Health & wellness, equity",
    "qualifications": "Ph.D., M.S. or Bachelors degree in Statistics, Economics, Machine Learning, Operations Research or other quantitative fields",
    "full_job_description": "About the job\nAttentive® is the AI-powered mobile marketing platform transforming the way brands personalize consumer engagement. Attentive enables marketers to craft tailored journeys for every subscriber, driving higher recurring revenue and maximizing campaign performance. Activating real-time data from multiple channels and advanced AI, the platform personalizes content, tone, and timing to deliver 1:1 messages that truly resonate.\n\nWith a top-rated customer success team recognized on G2, Attentive partners with marketers to provide strategic guidance and optimize SMS and email campaigns. Trusted by leading global brands like Neiman Marcus, Samsung, Wayfair, and Dyson, Attentive ensures enterprise-grade compliance and deliverability, supporting trillions of interactions across more than 70 industries. To learn more or request a demo, visit www.attentive.com or follow us on LinkedIn, X (formerly Twitter), or Instagram.\n\nAttentive’s growth has been recognized by Deloitte’s Fast 500, Linkedin’s Top Startups and Forbes Cloud 100 all thanks to the hard work from our global employees!\n\nAbout the Role\n\nOur Data Science team is a world-class data, applied science, and ML organization that leads data-driven decision-making and the conversational AI efforts for the entire company. Joining our team offers a high-growth career opportunity to work with some of the world’s most talented data scientists in a high-performance and high-impact culture.\n\nAs a Senior Data Scientist on our AI team, you will play a crucial role in transforming data into actionable insights and models for our AI product offerings. We are looking for an experienced scientist who relishes the opportunity to develop novel approaches and apply them at Attentive’s scale. Your contributions will directly influence the development of cutting-edge ML solutions, empowering our team to craft highly effective messaging strategies.\n\nWhat You'll Accomplish\nLead the development of statistical, econometric, optimization, and machine learning models for a range of applications in our messaging and AI product offerings. \nDesign and execute experiments, interpret results, and draw actionable conclusions. \nUse data to understand product performance, identify improvement opportunities, and define product/team roadmaps. \nPresent findings to senior leadership to inform and influence business decisions. \nCollaborate with cross-functional teams across product, engineering, client services, and sales to drive business value from ideation to production. \n\nYour Expertise\nPh.D., M.S. or Bachelors degree in Statistics, Economics, Machine Learning, Operations Research, or other quantitative fields. \nKnowledge of underlying mathematical foundations of statistics, machine learning, optimization, economics, and analytics. \nKnowledge of experimental design and analysis. \nExperience with exploratory data analysis, statistical analysis and testing, and model development. \nAbility to use Python to work efficiently at scale with large data sets. \nAdvanced proficiency in SQL. \n\nNice to Haves\n4+ years of industry experience as an Applied or Data Scientist or equivalent. \nFamiliarity with advanced statistical inference, experimentation, and causal inference methods. \nEconometric experience with pricing and promotion optimization\nExpertise in customer lifetime value modeling. \nExperience in personalization systems and cross-sectional cohort modeling. \nBackground in operations research (e.g., scheduling or assignment problems). \nKnowledge of advanced topics in XGBoost modeling. \n\n\nYou'll get competitive perks and benefits, from health & wellness to equity, to help you bring your best self to work.\n\nFor US based applicants:\n- The US base salary range for this full-time position is $230,000 - $280,000 annually + equity + benefits\n- Equity is a substantial part of the total compensation package\n- Our salary ranges are determined by role, level and location\n\n\nAttentive Company Values\nDefault to Action - Move swiftly and with purpose\nBe One Unstoppable Team - Rally as each other’s champions\nChampion the Customer - Our success is defined by our customers' success\nAct Like an Owner - Take responsibility for Attentive’s success\n\nLearn more about AWAKE, Attentive’s collective of employee resource groups.\n\nIf you do not meet all the requirements listed here, we still encourage you to apply! No job description is perfect, and we may also have another opportunity that closely matches your skills and experience.\n\nAt Attentive, we know that our Company's strength lies in the diversity of our employees. Attentive is an Equal Opportunity Employer and we welcome applicants from all backgrounds. Our policy is to provide equal employment opportunities for all employees, applicants and covered individuals regardless of protected characteristics. We prioritize and maintain a fair, inclusive and equitable workplace free from discrimination, harassment, and retaliation. Attentive is also committed to providing reasonable accommodations for candidates with disabilities. If you need any assistance or reasonable accommodations, please let your recruiter know.",
    "c_logo": "logos/attentive_4233763872.png",
    "extract_date": "2025-05-31T11:40:20.232275",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "Statistics, Economics, Machine Learning, Operations Research, experimental design, exploratory data analysis, statistical analysis, Python, SQL",
    "flag": 1,
    "First Seen": "2025-05-31T11:40:34.224014",
    "Last Updated": "2025-05-31T11:40:34.224021"
  },
  {
    "_id": {
      "$oid": "683a9d75473aab64224d4b6b"
    },
    "job_title": "Senior Data Scientist",
    "company_name": "SeatGeek",
    "job_location": "United States",
    "employment_type": "Full-time",
    "salary_range": "$190.8K/yr - $267.1K/yr · 401(k), Vision",
    "work_location_type": "Remote",
    "posted_date": "2 weeks ago",
    "apply_button_label": "Apply",
    "apply_url": "https://boards.greenhouse.io/embed/job_app?token=5709164&gh_src=94e407181&source=LinkedIn",
    "seniority_level": "Not Applicable",
    "job_id": "4229042109",
    "industry": "Ticketing Industry",
    "comp_desc": "Help the world experience more live. SeatGeek was built in 2009 as the only mobile ticketing marketplace created with fan experience top of mind. We’re transforming the way fans buy and sell their tickets to their favorite live events across sports, music, and theater. While we humbly believe we have the best consumer technology on the market, our mission goes beyond that – by bringing a technology-first approach to an entire industry sorely in need of a better solution, we aim to be a force for good in live entertainment. SeatGeek’s acquisition of TopTix marks our entrance into the primary market. From then on, we began providing the premier primary ticketing solution on the market, a perfect complement to our best-in-class consumer tech. Now our mission goes beyond the fan experience and brings power, control, and flexibility to rightsholders - reinventing live entertainment for the modern, mobile era. Looking to join us at SeatGeek? Apply through LinkedIn or our Jobs Page via our website. If you are contacted about a job at SeatGeek, please verify by reviewing the sender’s email (ex. bobsmith@seatgeek.com).",
    "tech_skills": "Python, R, SQL, Git, Airflow, Looker, ggplot/matplotlib",
    "benefits": "Equity stake, Flexible work environment, WFH stipend, Unlimited PTO, Fully-paid family leave, 401(k) matching program, Student loan support resources, Health, vision, dental, and life insurance, Family building and reproductive health services support, Gender-affirming care support program, Wellness expenses support, Subscriptions to Headspace, One Medical, Spotify/Apple Music/Amazon Music, Ticket stipend",
    "qualifications": "Degree or higher in economics, computer science, statistics, or mathematics or another quantitative discipline",
    "full_job_description": "About the job\nSeatGeek believes live events are powerful experiences that unite humans. With our technological savvy and fan-first attitude we’re simplifying and modernizing the ticketing industry. \n\nWe are looking for a Senior Data Scientist to join SeatGeek’s Demand Analytics team, focusing on measurement and optimization of marketing channel performances.\n\nYou will join a team that is the go-to partner on data production and insights generation for SeatGeek’s Demand team, which is responsible for our marketing strategies and operations. Your work will support strategies, optimization, and budget allocation decisions across marketing channels. You will develop a deep understanding of how SeatGeek can use its unique position in the industry to grow and retain our customers. You will tackle open ended questions, conduct exploratory analyses, design and analyze experiments, and build models.\n\nWhat You'll Do\n\nDevelop, validate and maintain machine learning models that support business strategies and decisions\nDesign experiments or use causal inference methods to measure channel incrementality or campaign effectiveness\nDevelop research questions and conduct data analysis to generate insights and recommendations that help SeatGeek make smarter decisions and enhance operational efficiency\nDefine, evaluate, and monitor key metrics, understanding the root causes of changes, and feeding them back to business stakeholders to action on\nWork closely with the Analytics Engineering team to build lasting, analysis-friendly data models, and perform batch models that run in production\nContribute to the development of the Demand Analytics function and the wider data community at SeatGeek with programming and problem-solving best practices\nPartner with stakeholders on the Demand team, understanding their objectives and aligning our work to complement and enhance their ability to achieve those goals\n\nWhat You Have\n\nExperience working on open-ended projects, and the ability to come up with creative, elegant solutions to complex issues\n5+ years of relevant applied experience with a degree or higher in economics, computer science, statistics, or mathematics or another quantitative discipline\nA strong understanding of standard statistical methods for analysis\nExpertise with at least one scripting language (ideally Python, though R is acceptable)\nExpert-level knowledge of SQL\nExperience with analytics & visualization tools (Looker, ggplot/matplotlib or equivalent)\nExperience performing analysis with large datasets\nIndependent thinking, ability to work autonomously, capability of taking on loosely defined problems and translating complex thinking into practical application for diverse audiences\nNatural communication skills with a value for building strong relationships with colleagues and partners and enjoys mentoring and teaching others\n\nOur stack\n\nWe do research and development work in a custom environment optimized for repeatability and collaboration. You absolutely do not need experience with all of these, but we thought you might be curious.\n\nLanguages: Python (preferred) or R, SQL\nVersion control: Git\nOrchestration: Airflow\n\nPerks\n\nEquity stake\nFlexible work environment, allowing you to work as many days a week in the office as you’d like or 100% remotely\nA WFH stipend to support your home office setup\nUnlimited PTO\nUp to 16 weeks of fully-paid family leave \n401(k) matching program\nStudent loan support resources\nHealth, vision, dental, and life insurance\nUp to $25k towards family building and reproductive health services\nGender-affirming care support program\n$500 per year for wellness expenses\nSubscriptions to Headspace (meditation), Headspace Care (therapy), and One Medical\n$120 per month to spend on tickets to live events\nAnnual subscription to Spotify, Apple Music, or Amazon music\n\nThe salary range for this role is $133,000-$192,000. Actual compensation packages within that range are based on a wide array of factors unique to each candidate, including but not limited to skill set, years and depth of experience, certifications, and specific location.\n\nSeatGeek is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, religion, creed, age, national origin or ancestry, ethnicity, sex, sexual orientation, gender identity or expression, disability, military or veteran status, or any other category protected by federal, state, or local law. As an equal opportunities employer, we recognize that diversity is a positive attribute and we welcome the differences and benefits that a diverse culture brings. Come join us!\n\nTo review our candidate privacy notice, click here.",
    "c_logo": "logos/seatgeek_4229042109.png",
    "extract_date": "2025-05-31T11:40:42.922878",
    "domain_name": "PLM",
    "software_name": "Teamcenter",
    "contract_duration": "Not Applicable",
    "expected_hours_per_week": "Not Applicable",
    "required_skills": "Open-ended project experience, Statistical analysis, Scripting language (Python or R), SQL, Analytics & visualization tools, Large dataset analysis, Independent thinking, Communication skills",
    "flag": 1,
    "First Seen": "2025-05-31T11:41:01.533133",
    "Last Updated": "2025-05-31T11:41:01.533144"
  }
]
